cf/InformationRegisters/ExternalModulesConnectionModesDataAreas.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ExternalModulesConnectionModesDataAreas</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SafeMode</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.SafeMode</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>SoftwareModulePresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>SoftwareModuleType</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SoftwareModuleID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ReasonsForDisablingAdditionalReportsAndDataProcessorsSaaS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ReasonsForDisablingAdditionalReportsAndDataProcessorsSaaS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BlockAdministratorService</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BlockingByOwner</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfigurationVersionUpdate</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/AdditionalReportsAndDataProcessorsPublicationOptions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>AdditionalReportsAndDataProcessorsPublicationOptions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Used</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DebugMode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Disabled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Users.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Users</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>NotValid</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prepared</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseUserProperties</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>State</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/SuppliedAdditionalReportsAndDataProcessors.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>SuppliedAdditionalReportsAndDataProcessors</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportsAndDataProcessorsKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForObjectForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForListForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Publication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportsAndDataProcessorsPublicationOptions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShutdownCause</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReasonsForDisablingAdditionalReportsAndDataProcessorsSaaS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Information</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SafeMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessorStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VariantsStorage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDVersion</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ControlCompatibilityWithConfigurationVersions</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsesVariantsStorage</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PermissionsCompatibilityMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportAndDataProcessorPermissionCompatibilityModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Commands</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StartVariant</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AdditionalDataProcessorsCallMethods</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Comment>Command presentation for the last user</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ShowAlert</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Modifier</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Hide</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Compatibility</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Version</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>permissions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>TypePermissions</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Parameters</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/MessagesManagementAdditionalReportsAndDataProcessorsImplementation/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// A COMMON IMPLEMENTATION OF MESSAGE DATA PROCESSOR OF ADDITIONAL REPORTS AND DATA PROCESSOR MANAGEMENT
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// PROGRAMMING INTERFACE

// Data processor of incoming messages with type {http://www.1c.ru/1cFresh/ApplicationExtensions/Management/a.b.c.d}InstallExtension
//
// Parameters:
//  InstallationDetails - Structure, keys:
//    ID - UUID, unique
//      identifier of catalog item ref SuppliedAdditionalReportsAndDataProcessors, 
//    Presentation - String, installation presentation of
//      supplied additional data processor (will be used as
//      the name of the catalog item AdditionalReportsAndDataProcessors),
//    Installation - UUID, unique
//      ID of additional supplied data processor installation
//      ( will be used as unique ID of catalog ref AdditionalReportsAndDataProcessors), 
//  CommandSettings - ValueTable containing command settings
//      for installation of supplied additional data processor, columns:
//    ID - String, command ID
//    QuickAccess - Array(UUID), 
//      an array of unique IDs which identify service users
//      for whom the command should be included to the quick access, 
//    Schedule - RegulatoryTaskSchedule,  
//      schedule for setting the command of the additional data processor
//      (if command execution is enabled as a scheduled job),
//   Sections - ValuesTable containing commands enabling
//      settings to install the supplied additional data processor to command interface processor, columns:
//    Section - CatalogRef.MetadataObjectsIDs,
//  CatalogsAndDocuments - ValuesTable containing commands enabling
//      settings to install the supplied additional data processor to forms interface list and items, columns:
//    ObjectDestination - CatalogRef.MetadataObjectsIDs,
//  AdditionalReportOptions - Array(String), array containing
//    report variant keys of additional report, 
//  ServiceUserID - UUID defining
//    service user who activated installation of supplied additional data processor.
//
Procedure SetAdditionalReportOrProcessing(Val InstallationDetails,
		Val CommandSettings, Val SettingsLocationOfCommands, Val Sections, Val CatalogsAndDocuments, Val AdditionalReportVariants,
		Val ServiceUserID) Export
	
	// Settings are filled by message data
	QuickAccess = New ValueTable();
	QuickAccess.Columns.Add("CommandID", New TypeDescription("String"));
	QuickAccess.Columns.Add("User", New TypeDescription("CatalogRef.Users"));
	
	Jobs = New ValueTable();
	Jobs.Columns.Add("ID", New TypeDescription("String"));
	Jobs.Columns.Add("ScheduledJobSchedule", New TypeDescription("ValueList"));
	Jobs.Columns.Add("ScheduledJobUse", New TypeDescription("Boolean"));
	
	For Each CommandSetting IN CommandSettings Do
		
		If ValueIsFilled(CommandSetting.QuickAccess) Then
			
			For Each UserID IN CommandSetting.QuickAccess Do
				
				QueryText = "SELECT
				               |	Users.Ref
				               |FROM
				               |	Catalog.Users AS Users
				               |WHERE
				               |	Users.ServiceUserID = &ServiceUserID";
				Query = New Query(QueryText);
				Query.SetParameter("ServiceUserID", UserID);
				Result = Query.Execute();
				If Result.IsEmpty() Then
					
					Continue;
					
				Else
					
					Selection = Result.Select();
					Selection.Next();
					ItemRapidAccess = QuickAccess.Add();
					ItemRapidAccess.CommandID = CommandSetting.ID;
					ItemRapidAccess.User = Selection.Ref;
					
				EndIf;
				
			EndDo;
			
		EndIf;
		
		If CommandSetting.Schedule <> Undefined Then
			
			Job = Jobs.Add();
			Job.ID = CommandSetting.ID;
			ScheduledJobSchedule = New ValueList();
			ScheduledJobSchedule.Add(CommandSetting.Schedule);
			Job.ScheduledJobSchedule= ScheduledJobSchedule;
			Job.ScheduledJobUse = True;
			
		EndIf;
		
	EndDo;
	
	AdditionalReportsAndDataProcessorsSaaS.SetIncludedProcessingInDataArea(
		InstallationDetails,
		QuickAccess,
		Jobs,
		Sections,
		CatalogsAndDocuments,
		SettingsLocationOfCommands,
		AdditionalReportVariants,
		GetAreaUserByServiceUserID(
			ServiceUserID));
	
EndProcedure

// Data processor of incoming messages with type {http://www.1c.ru/1cFresh/ApplicationExtensions/Management/a.b.c.d}DeleteExtension
//
// Parameters:
//  IDSuppliedDataProcessors - UUID,
//    ref to the catalog item SuppliedAdditionalReportsAndDataProcessors;
//  IDOfUsedDataProcessor - UUID,
//    reference to the catalog item AdditionalReportsAndDataProcessors.
//
Procedure DeleteAdditionalReportOrProcessing(Val IDSuppliedDataProcessors, Val IDOfUsedDataProcessor) Export
	
	SuppliedDataProcessor = Catalogs.SuppliedAdditionalReportsAndDataProcessors.GetRef(
			IDSuppliedDataProcessors);
	
	AdditionalReportsAndDataProcessorsSaaS.DeleteComesFromDataProcessingAreas(
		SuppliedDataProcessor,
		IDOfUsedDataProcessor);
	
EndProcedure

// Data processor of incoming messages with type {http://www.1c.ru/1cFresh/ApplicationExtensions/Management/a.b.c.d}DisableExtension
//
// Parameters:
//  IDExpansion - UUID,
//    ref to the catalog item SuppliedAdditionalReportsAndDataProcessors,
//   DisconnectionCause - EnumRef.ReasonsForDisablingAdditionalReportsAndDataProcessorsSaaS.
//
Procedure DisableAdditionalReportOrProcessing(Val IDExpansion, Val ShutdownCause = Undefined) Export
	
	If ShutdownCause = Undefined Then
		ShutdownCause = Enums.ReasonsForDisablingAdditionalReportsAndDataProcessorsSaaS.BlockAdministratorService;
	EndIf;
	
	SetPrivilegedMode(True);
	SuppliedDataProcessor = Catalogs.SuppliedAdditionalReportsAndDataProcessors.GetRef(
		IDExpansion);
	
	If CommonUse.RefExists(SuppliedDataProcessor) Then
		
		Object = SuppliedDataProcessor.GetObject();
		
		Object.Publication = Enums.AdditionalReportsAndDataProcessorsPublicationOptions.Disabled;
		Object.ShutdownCause = ShutdownCause;
		
		Object.Write();
		
	EndIf;
	
EndProcedure

// Data processor of incoming messages with type {http://www.1c.ru/1cFresh/ApplicationExtensions/Management/a.b.c.d}EnableExtension
//
// Parameters:
//  IDExpansion - UUID,
//  ref to the catalog item SuppliedAdditionalReportsAndDataProcessors
//
Procedure EnableAdditionalReportOrProcessing(Val IDExpansion) Export
	
	SetPrivilegedMode(True);
	SuppliedDataProcessor = Catalogs.SuppliedAdditionalReportsAndDataProcessors.GetRef(
		IDExpansion);
	
	If CommonUse.RefExists(SuppliedDataProcessor) Then
		
		Object = SuppliedDataProcessor.GetObject();
		
		Object.Publication =
			Enums.AdditionalReportsAndDataProcessorsPublicationOptions.Used;
		
		Object.Write();
	EndIf;
	
EndProcedure

// Data processor of incoming messages with type {http://www.1c.ru/1cFresh/ApplicationExtensions/Management/a.b.c.d}DropExtension
//
// Parameters:
//  IDExpansion - UUID,
//  ref to the catalog item SuppliedAdditionalReportsAndDataProcessors
//
Procedure RecallAdditionalReportOrProcessing(Val IDSuppliedDataProcessors) Export
	
	SetPrivilegedMode(True);
	SuppliedDataProcessor = Catalogs.SuppliedAdditionalReportsAndDataProcessors.GetRef(
		IDSuppliedDataProcessors);
	
	If CommonUse.RefExists(SuppliedDataProcessor) Then
		AdditionalReportsAndDataProcessorsSaaS.RecallProvidedAdditionalInformationProcessor(
			SuppliedDataProcessor);
	EndIf;
	
EndProcedure

// Processing the incoming messages with type {http://www.1c.ru/1CFresh/ApplicationExtensions/Management/a.b.c.d}SetExtensionSecurityProfile
//
// Parameters:
//  IDSuppliedDataProcessors - UUID,
//    ref to the catalog item SuppliedAdditionalReportsAndDataProcessors;
//  IDOfUsedDataProcessor - UUID,
//    ref to the catalog item AdditionalReportsAndDataProcessors.
//
Procedure SetModeForAdditionalReportConnectionOrDataAreaProcessor(Val IDSuppliedDataProcessors, Val IDOfUsedDataProcessor, Val ConnectionMode) Export
	
	SuppliedDataProcessor = Catalogs.SuppliedAdditionalReportsAndDataProcessors.GetRef(
		IDSuppliedDataProcessors);
	
	UsingDataProcessor = Catalogs.AdditionalReportsAndDataProcessors.GetRef(
		IDOfUsedDataProcessor);
	
	If CommonUse.RefExists(UsingDataProcessor) Then
		
		Manager = InformationRegisters.ExternalModulesConnectionModesDataAreas.CreateRecordManager();
		Manager.ExternalModule = SuppliedDataProcessor;
		Manager.SafeMode = ConnectionMode;
		Manager.Write();
		
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

Function GetAreaUserByServiceUserID(Val ServiceUserID)
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	Users.Ref AS Ref
	|FROM
	|	Catalog.Users AS Users
	|WHERE
	|	Users.ServiceUserID = &ServiceUserID";
	Query.SetParameter("ServiceUserID", ServiceUserID);
	
	Block = New DataLock;
	LockItem = Block.Add("Catalog.Users");
	
	BeginTransaction();
	Try
		Block.Lock();
		Result = Query.Execute();
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
	If Result.IsEmpty() Then
		MessagePattern = NStr("en='User with user identifier of service %1 is not found';ru='Не найден пользователь с идентификатором пользователя сервиса %1'");
		MessageText = StringFunctionsClientServer.SubstituteParametersInString(MessagePattern, ServiceUserID);
		Raise(MessageText);
	EndIf;
	
	Return Result.Unload()[0].Ref;
	
EndFunction
